## DF合并

In [1]:
import pandas as pd

In [2]:
df1 =  pd.DataFrame({
     'key': ['b','b','a','c','a','a','b'],
    'data1': range(7)
})
df2 = pd.DataFrame({
     'key': ['a','b','d'],
    'data2': range(3)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [3]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [4]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [5]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [6]:
# 对象的列名不同，进行merge
# inner 交集
# outer 并集
df3 = pd.DataFrame({'1key': ['b','b','a','c','a','a','b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a','b','d'],
                    'data2': range(3)})
pd.merge(df3, df4, left_on='1key', right_on='rkey')

  1key  data1  data2 rkey
0    b      0      1    b
1    b      1      1    b
2    b      6      1    b
3    a      2      0    a
4    a      4      0    a
5    a      5      0    a

In [7]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [8]:
# 多对多的合并
df1 = pd.DataFrame({'key': ['b','b','a','c','a','b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a','b','a','b','d'],
                   'data2': range(5)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [9]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [14]:
# 多对多连接产生是笛卡尔积
pd.merge(df1, df2, on='key', how='right')

    data1 key  data2
0     0.0   b      1
1     1.0   b      1
2     5.0   b      1
3     0.0   b      3
4     1.0   b      3
5     5.0   b      3
6     2.0   a      0
7     4.0   a      0
8     2.0   a      2
9     4.0   a      2
10    NaN   d      4

In [11]:
pd.merge(df1, df2, how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

![WX20181126-141207@2x.png](https://i.loli.net/2018/11/26/5bfb8ed263222.png)

## 索引上的合并

In [15]:
left1 = pd.DataFrame({'key': ['a','b','a', 'a', 'b', 'c'],
                        'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a','b'])
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [16]:
right1

   group_val
a        3.5
b        7.0

In [17]:
"""
index=True 或者 right_index =True 说明索引应该被用作连接
"""
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [18]:
"""
默认的merge方式使用的是内连接，--- 交集
外连接的方式 --- 并集
"""
# 求取并集
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

### 层次化索引数据

In [22]:
import numpy as np

In [27]:
left = pd.DataFrame({
        'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'key2': [2000, 2001, 2002, 2001, 2002],
        'data': np.arange(5)})

# 层次化索引
right = pd.DataFrame(np.arange(12).reshape((6,2)),
                    index = [['Nevada', 'Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio'],
                            [2001, 2000, 2000, 2000, 2001, 2002],],
                        columns = ['event1', 'event2'])
left

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [26]:
right

             event1  event2
Nevada 2001       0       1
       2000       2       3
       2000       4       5
Ohio   2000       6       7
       2001       8       9
       2002      10      11

In [28]:
# 以列表的形式指明用作合作并键的多个列
pd.merge(left, right, left_on = ['key1', 'key2'], right_index = True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [30]:
# 交集
pd.merge(left, right, left_on=['key1', 'key2'], right_index=True, how='outer')

   data    key1  key2  event1  event2
0   0.0    Ohio  2000     6.0     7.0
1   1.0    Ohio  2001     8.0     9.0
2   2.0    Ohio  2002    10.0    11.0
3   3.0  Nevada  2001     0.0     1.0
4   4.0  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000     2.0     3.0
4   NaN  Nevada  2000     4.0     5.0

In [32]:
# 合并双方的索引
left2 = pd.DataFrame([[1,2],[3,4],[5,6]],
                    index=['a','c','e'],
                    columns=['Ohio', 'Nevada'])

right2 = pd.DataFrame([[7,8], [9,10], [11,12],[13,14]],
                     index=['b', 'c', 'd', 'e'],
                     columns=['Missouri', 'Alabama'])
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [33]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [35]:
# 合并双方索引
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [37]:
# 使用 join 合并索引 , 更加方便实现索引合并
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [38]:
another = pd.DataFrame([[7,8], [9,10], [11,12], [16,17]],
                      index = ['a','c','e','f'],
                      columns=['New York', 'Oregon'])
another

   New York  Oregon
a         7       8
c         9      10
e        11      12
f        16      17

In [39]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
c     3       4       9.0     10.0         9      10
e     5       6      13.0     14.0        11      12

## 轴向连接

* concatenation
* 绑定(binding)
* 堆叠(stacking)

In [40]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [41]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [42]:
s1 = pd.Series([0,1], index=['a', 'b'])
s2 = pd.Series([2,3,4], index=['c', 'd', 'e'])
s3 = pd.Series([5,6], index = ['f', 'g'])

pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [43]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [45]:
s4 = pd.concat([s1*5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [46]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [47]:
pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [48]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

![WX20181126-181855@2x.png](https://i.loli.net/2018/11/26/5bfbc89ed9c90.png)

## 合并重叠数据

In [53]:
a = pd.Series([np.nan, 2.5, np.nan,3.5, 4.5, np.nan],
             index = ['f', 'e', 'd','c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
             index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [54]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [56]:
# 使用 where
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [57]:
# combine_first 方法
"""
使用combine_first会只更新左表的nan值。而update则会更新左表的所有能在右表中找到的值（两表位置相对应）。
"""
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [63]:
df1 = pd.DataFrame({'a': [1, np.nan, 5, np.nan],
                  'b': [np.nan, 2, np.nan, 6],
                  'c': range(2, 18, 4)})

df2 = pd.DataFrame({
    'a': [5,4,np.nan, 3, 7],
    'b': [np.nan, 3,4, 6, 8]})
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# 重塑和轴向旋转
## 重塑层次化索引

* `stack`: 将数据的列”旋转“为行。
* `unstack`: 将数据的行”旋转“为列

In [66]:
# 对行， 列 命名
data = pd.DataFrame(np.arange(6).reshape((2,3)), 
                   index = pd.Index(['Ohio', 'Colorado'], name='state'),
                   columns = pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [70]:
result = data.stack()
result # 类型为 pandas.core.series.Series

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [68]:
# 对于一个层次化的Series，用unstake将其重排位DataFrame
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [74]:
s1 = pd.Series([0,1,2,3], index=['a','b','c','d'])
s2 = pd.Series([4,5,6], index=['c', 'd', 'e'])
data2 = pd.concat([s1,s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [75]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [77]:
# stack默认会滤除缺失数据， 运算可逆
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [78]:
df = pd.DataFrame({
    'left': result,
    'right': result + 5},
    columns = pd.Index(['left', 'right'], name='size')
)
df

size             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

## 将‘长格式’ 旋转为 ‘宽格式’

## 数据转换

### 移除重复数据

In [83]:
data = pd.DataFrame({
    'k1': ['one']*3 + ['two'] * 4,
    'k2': [1,1,2,3,3,4,4]
})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [85]:
# 返回一个布尔型Series， 表示各行是否重复
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [87]:
# 移除重复行
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [88]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [97]:
#  duplicated , drop_duplicates 默认保留第一个出现的值组合
# take_last = True ,取最后一个重复的值
"""
subset : column label or sequence of labels, optional 
用来指定特定的列，默认所有列
keep : {‘first’, ‘last’, False}, default ‘first’ 
删除重复项并保留第一次出现的项
inplace : boolean, default False 
是直接在原来数据上修改还是保留一个副本
"""
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

## 利用函数或映射进行数据转换

In [101]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'Pastrami',
                            'corned beef', 'Bacon', 'pastrami','honey ham', 
                             'nova lox'],
                   'ounces': [4,3,12,6,7.5, 8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [102]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'pig',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

# map 方法接收一个函数或者含有映射的字典对象。
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     pig
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [104]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       pig
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [105]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     pig
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## 替换值

In [107]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [109]:
# Series 值替换
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [111]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [112]:
data.replace({-1999:np.nan, -1000:0})

0      1
1   -999
2      2
3   -999
4      0
5      3
dtype: int64

## 重命名轴索引

In [114]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [115]:
# 轴标签也有map方法
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [116]:
data.index  = data.index.map(str.upper)

In [117]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [119]:
# 创建数据集的转换板，不修改原始数据
# 返回新的数据集
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [122]:
# rename 可以实现字典对象对部分轴标签进行更新
# 使用字典方式更新,返回的是一个新对象
data.rename(
    index = {'OHIO': 'INDIANA'},
    columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

## 离散化和面元划分

In [135]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
# 18~25, 26~35, 35~60, 60~
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [136]:
# cats.labels
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [137]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [138]:
# 左边，或者右边是闭端，可以使用 right=False
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [140]:
# bins = [18,25,35,60,100]
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins,  labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [MiddleAged < Senior < YoungAdult < Youth]

In [141]:
# 面元数量
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.75, 1.0], (0.0095, 0.26], (0.0095, 0.26], (0.26, 0.5], (0.75, 1.0], ..., (0.5, 0.75], (0.26, 0.5], (0.26, 0.5], (0.5, 0.75], (0.26, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.0095, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [142]:
# qcut

data = np.random.randn(1000) # 正态分布
cats = pd.qcut(data, 4)
cats

[(-3.263, -0.674], (-3.263, -0.674], (0.0101, 0.675], (0.675, 2.807], (0.675, 2.807], ..., (-3.263, -0.674], (0.0101, 0.675], (0.675, 2.807], (0.675, 2.807], (-0.674, 0.0101]]
Length: 1000
Categories (4, interval[float64]): [(-3.263, -0.674] < (-0.674, 0.0101] < (0.0101, 0.675] < (0.675, 2.807]]

In [143]:
pd.value_counts(cats)

(0.675, 2.807]      250
(0.0101, 0.675]     250
(-0.674, 0.0101]    250
(-3.263, -0.674]    250
dtype: int64

In [144]:
# 设置自定义的分位数
pd.cut(data, [0, 0.1, 0.5, 0.9, 1])

[NaN, NaN, (0.0, 0.1], (0.5, 0.9], NaN, ..., NaN, (0.0, 0.1], NaN, NaN, NaN]
Length: 1000
Categories (4, interval[float64]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

## 检查过滤异常值

In [145]:
np.random.seed(12345)
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [148]:
# 找出某一列绝对值大小超过3的值
col = data[3]
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [154]:
# 选出含有”超过3或-3的值“的行 ，利用 any方法
"""
axis,0/1,默认为0轴
skipna,布尔值，默认为True,若整行或整列为NA则返回NA
level,整数，默认为空，当层次化索引时使用
bool_only,只考虑布尔值，默认为False
"""
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [156]:
# 将值限制在 -3 到3 之内
# np.sign 返回的是一个由1 和 -1 组成的数组。表示原始值的符号。
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

## 排列和随机采样

In [163]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [164]:
"""
利用 numpy.random.permutaion 函数实现对DataFrame的列排列。
随机重排序。
"""
sample = np.random.permutation(5)
sample

array([1, 3, 0, 2, 4])

In [166]:
df.take(sample)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [169]:
# 不想用替换的方式产生样本
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [170]:
# 替换的方式产生样本
bag = np.array([5, 7, -1, 6, 4])
sample = np.random.randint(0, len(bag), size=10)
sample

array([3, 0, 4, 1, 1, 2, 3, 0, 1, 2])

In [171]:
draws = bag.take(sample)
draws

array([ 6,  5,  4,  7,  7, -1,  6,  5,  7, -1])

## 计算指标 哑变量

In [172]:
df = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c','a','b'],
    'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [174]:
# 增加前缀 key
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummpy = df[['data1']].join(dummies)
df_with_dummpy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## 字符串操作

In [177]:
# 逗号分隔的字符串用split拆分成段
val = 'a,b,guido'
val.split(',')

['a', 'b', 'guido']

In [176]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

['a', ',', 'b', ',', 'g', 'u', 'i', 'd', 'o']

`python内置字符串方法`
![WX20181129-124810@2x.png](https://i.loli.net/2018/11/29/5bff6f982f6d5.png)

## pandas中矢量化的字符串函数

In [191]:
data = {'Dave': 'dave@google.com', 
       'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com',
       'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [192]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [193]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [194]:
# 通过str.contains 检查各个电子邮电地址是否含有'gmail'
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [196]:
import re
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'
# 使用正则匹配
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [197]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [198]:
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [199]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

## 矢量化的字符串方法
![WX20181129-131202@2x.png](https://i.loli.net/2018/11/29/5bff7535ea58d.png)